let blocks = [
    {
      name: 'Декрет о мире',
      photo: 'images/LeninUndKarte',
      discription:'Товарищи! КПТБ продолжает публикацию важнейших документов Советской власти. Это необходимо в целях поднятия политической грамотности наших сторонников и читателей, а так же членов и активистов самой организации. Изучение документов первого рабочего и крестьянского правительства серьёзно поможет в борьбе со множеством мифов, навязанных буржуазией с целью сохранить рабское положение трудящихся, их невежество и их темноту!<br><br>Декрет о мире был написан Владимиром Лениным в первые часы после взятия власти Советами. Этим декретом Советское правительство сделало первый шаг на пути освобождения измученного народа России от войны. Он предложил «всем воюющим народам и их правительствам начать немедленно переговоры о «справедливом демократическом мире» — а конкретно, о «немедленном мире без аннексий и контрибуций», то есть без захватов чужих территорий и без насильственного взыскания с побеждённых материальных или денежных возмещений. Декрет был единогласно принят на 26 октября (8 ноября) 1917 на Втором съезде Советов рабочих, крестьянских и солдатских депутатов.<br><br>Максимальное распространение документа, товарищи!',
      source:'decretOMire.html',
    },
    {
      name: 'Образование Союза Советских Социалистических Республик',
      photo: 'images/sovietStart',
      discription:'Перед Новым Годом, 30 декабря, 1922 года делегаты: Михаил Калинин, Михаил Цхакая, Михаил Фрунзе и Григорий Петровский, Александр Червяков - подписали договор и декларацию о создании Союза Советских Социалистических Республик и объединили братские народы, дав пролетариям союзных республик возможность “... обеспечить свое существование и приступить к мирному хозяйственному строительству.”',
      source:'sovietStart.html',
    },
    {
      name: 'Отрывок из Доклада о революции 1905 года',
      photo: 'images/1905Revolution',
      discription:'Весной 1905 года крестьянское движение было только в зачатке, оно охватило лишь меньшинство уездов, приблизительно седьмую их часть...',
      source:'otrywok.html',
    },
    {
      name: 'День, перевернувший ход истории: Великая Октябрьская Социалистическая Революция',
      photo: 'images/leninOctoberRevolution',
      discription:'Здравствуйте, Товарищи! Коммунистическая партия Трудящегося Большинства поздравляет граждан всех стран с 103-й годовщиной Великой Октябрьской Социалистической революции!Не раз мы ещё коснёмся темы Великой Октябрьской Революции. В этом обращении мы лишь дадим общую характеристику происходивших событий, покажем роль этого события в истории.',
      source:'greatDay.html',
    },
    {
      name: 'Великая Октябрьская социалистическая революция',
      photo: 'images/octoberRevolution',
      discription:'<b>Здравствуйте, товарищи!</b><br>Сегодня мы расскажем про <b>Великую Октябрьскую социалистическую революцию.</b> Она произошла в ноябре 1917 года в ночь с 6 по 7 число. По ее итогам было свергнуто временное правительство и начался процесс установления советской власти на 1/6 части суши, было создано передовое социалистическое государство, где власть впервые в истории принадлежала рабочему классу.',
      source:'7november.html',
    },
    {
      name: 'Про Социализм',
      photo: 'images/ivanFranko',
      discription:'Социализм - это соревнование устранить всякую общественное неравенство, всякий эксплуатация и всякое вбожество, ввести справедливый, счастливее настоящего строй, а именно таким способом, чтобы настоящее продукционный капитал, то есть почвы, фабрики, машины и другие орудия труда, а так же всякая сырье, вместо быть частной собственностью нескольких людей, должно перейти в собственность общественности.',
      source:'franko.html',
    },
    {
      name: 'Национальный вопрос в Киргизии',
      photo: 'images/not_white_power_not_black_power_but_workers_power_poster',
      discription:'Здравствуйте товарищи читатели!<br><br>Сегодня на повестке дня в Кыргызстане стоит национальный вопрос. Поводом тому стали две ситуации: В августе мужчина напал на женщину вследствие разговора с ним на кыргызском языке, в июне старшеклассники напали на мальчика причиной тому стала - по версии родителей- межнациональная и даже межрелигиозная рознь.<br>Чтобы внести ясность в этой ситуации в Кыргызстане, и объяснить  явление в принципе, мы обратимся к марксистской  науке и будем её  использовать . В конце  выведем заключение.',
      source:'kirgizArticle.html',
    },
    {
      name: 'В чем же единство российских и украинских пролетариев?',
      photo: 'images/rusukrPlakat',
      discription:'Здравствуйте, товарищи. Недавно президент Российской Федерации, Владимир Владимирович Путин, написал свою, не побоюсь этого слова, скандальную статью о том, что украинцы и русские – один народ, которая почти мгновенно вызвала большое негодование у официального Киева и украинских националистов. Так давайте же и мы выразим свое мнение по данному вопросу с марксистской точки зрения.',
      source:'ukraineArticle.html',
    },
    {
      name: 'Сидор Артемьевич Ковпак',
      photo: 'images/sidorKovpak',
      discription:'<b>Здравствуйте, товарищи коммунисты!</b> <br><br> Сегодня мы вам расскажем про известного красного партизана, борца с фашистко-немецкими и бандеровскими окупантами, коммуниста и героя Сидора Артемьевича Ковпака.',
      source:'sidorkovpak.html',
    },
    {
      name: 'Отчуждение',
      photo: 'images/mptbLogo',
      discription:'<b>Здравствуйте, товарищи.</b> <br><br> Сегодня мы расскажем вам об отчуждении трудящегося от плодов его труда при капиталистической системе производства.',
      source:'otchuzhdenie.html',
    }
]

const container = document.querySelector('.container');
    let content1 = blocks.map(block => `
        <div class="item">
            <img src="${block.photo}\.jpg" class="photo" alt="photo">
            <br>
            <h2>${block.name}</h2>
            <br>
            <div class="info"><p>${block.discription}</p></div>
            <br>
            <i><a href="${block.source}">Читать подробнее...</a></i>
        </div>
    `);

container.innerHTML = content1.join('');


function addLink() {
  var body_element = document.getElementsByTagName('body')[0];
  var selection;
  selection = window.getSelection();
  var pagelink = "<br /><br /> Источник: <a href='"+document.location.href+"'>"+document.location.href+"</a><br />";
  var copytext = selection + pagelink;
  var newdiv = document.createElement('div');
  newdiv.style.position='absolute';
  newdiv.style.left='-99999px';
  body_element.appendChild(newdiv);
  newdiv.innerHTML = copytext;
  selection.selectAllChildren(newdiv);
  window.setTimeout(function() {body_element.removeChild(newdiv)},0);
}
document.oncopy = addLink;
