let blocks = [
     {
      name: 'Загроза імперіалістичної війни',
      photo: 'images/antiWarPoster',
      discription:'Товариші, в останній час ми все частіше чуємо про загрозу нової імперіалістичної війни. Пропагандисти з усіх сторін кличуть народ до єднання навколо інтересів капіталістів задля захисту Батьківщини. Вони навмисно розпалюють провоєнні настрої.<br><br>Але нам не варто забувати, що війна принесе простому народові лише більше зубожіння та смертей. Уся націоналістична, реваншистська пропаганда спрямована лише на виправдання майбутньої афери капіталістів, щоб ще більше заробити, щоб мати не десять маєтків, а двадцять, щоб ще краще було капіталісту відпочивати на курортах Франції та Італії, поки шахтарі вмирають від невиконання базових норм безпеки та вчителів звільняють через "оптимізацію".<br><br>В очікуванні нової війни ми, робітничий клас, не повинні захищати тих, хто нас грабує та вбиває. Ми повинні єднатися не на національній, а на класовій основі. Нам треба не помирати за статки олігархів, не йти проти інших робітників, хоч і з "ворожої" країни, а виступити єдиним робітничим фронтом проти війни.<br><br>Робітникам кожної країни, за ленінським принципом, треба бажати поразки своєму уряду, що веде імперіалітичну війну, щоб його послабити, а також домагитися перетворення війни імперіалістичної у війну громадянську за нашу свободу, за наші права, за владу робітничого класу!',
      source:'МПТБ, 1 грудня 2021.',
     },
     {
      name: 'Положение о рабочем контроле',
      photo: 'images/bolschewikPartei',
      discription:'Здравствуйте, товарищи.<br><br>27 ноября 1917 года Всероссийский Центральный Исполнительный Комитет принял «Положение о рабочем контроле». Согласно данному документу рабочий контроль вводился как обязательная мера во всех отраслях хозяйства, на предприятиях, имевших наёмных рабочих.<br><br>Как писал Владимир Ильич Ленин: <i>"Первым основным шагом, который обязателен для всякого социалистического, рабочего правительства, должен быть рабочий контроль"</i>.<br><br>Впервые принципы рабочего контроля были сформулированы еще Парижской коммуной. Однако в силу недолгого существования самой Коммуны такая мера рабочего управления не была реализована толком на практике. В России после февральских событий 1917 г. на многих крупных предприятиях Петрограда, Москвы и других промышленных центров стало возникать движение за рабочий контроль, который являлся формой вмешательства рабочих в капиталистическую экономику. В октябре 1917 г. на II-м Всероссийском съезде Советов было заявлено, что Советская власть повсеместно установит над производством рабочий контроль, рассматриваемый как одна из основных переходных мер от капиталистической организации хозяйства к социалистической.<br><br>Согласно Положению, в каждом крупном городе, губернии или промышленном районе предписывалось создание местного Совета рабочего контроля. В Петрограде был создан Всероссийский Совет рабочего контроля. Органами рабочего контроля являлись фабрично-заводские комитеты, советы старост, а на крупных предприятиях действовали специальные контрольные комиссии. Основной формой рабочего управления был контроль над производственно-технической, а нередко и коммерческо-финансовой деятельностью предприятий: например, за наймом и увольнением рабочих и служащих, за поступлением и использованием заказов.<br><br>Новая мера социального контроля Советского государства устанавливала для владельцев предприятий обязательное предъявление органам рабочего контроля всей документации. В противном случае виновные руководители должны были отвечать перед судом. Решения органов рабочего контроля были обязательны для всех владельцев и могли быть отменены только постановлением высших органов рабочего контроля.<br><br>Таким образом, впервые в истории на практике был реализован принцип рабочего самоуправления на производстве. Рабочие сами смогли управлять предприятием без посредничества буржуев.',
      source:'МПТБ, 27 ноября 2021 год.',
     },
     {
      name: 'Феликс Дзержинский о человеческом счастье',
      photo: 'images/felix_edmundovich',
      discription:'«Сколько таких людей, чувства которых извращены, которые обречены на то, чтобы никогда, даже во сне, не увидеть подлинного счастья и радости жизни! А в природе человека есть ведь эта способность чувствовать и воспринимать счастье! Горсть людей лишила этой способности миллионы, исковеркав и развратив самое себя; остались только «безумие и ужас», «ужас и безумие» или роскошь и удовольствия, находимые в возбуждении себя алкоголем, властью, религиозным мистицизмом. Не стоило бы жить, если бы человечество не озарялось звездой социализма, звездой будущего. Ибо «я» не может жить, если оно не включает в себя всего остального мира и людей. Таково это «я»…»',
      source:'Феликс Эдмундович Дзержинский, "Дневник заключённого"',
     },
     {
      name: 'Создание Первой Конной дивизии',
      photo: 'images/konnaya_divizia',
      discription:'Добрый день, товарищи!<br><br>В этот день, 19 ноября 1919 года, была создана Первая Конная армия.<br><br>Конная армия была создана по решению РВС Южного фронта и при непосредственном участии И. В. Сталина. Реввоенсовет Советской Республики 17 ноября 1919 года принял решение о создании Первой конной армии под командованием С. М. Будённого.<br><br>Армия была образована на базе трёх дивизий (4-й, 6-й и 11-й) 1-го конного корпуса Будённого по приказу РВС Южного фронта от 19 ноября 1919 года. В апреле 1920 года к ним присоединили 14-ю и 2-ю имени Блинова кавказская дивизии, Отдельную кавказскую бригаду особого назначения, автобронеотряд имени Я. М. Свердлова, четыре бронепоезда: «Красный кавалерист», «Коммунар», «Смерть Директории», «Рабочий», авиационную группу  и другие части, общей численностью 16-17 тысяч человек личного состава. В ряде операций в подчинение Первой конной армии поступали две-три стрелковые дивизии.<br><br>Армия прославилась в ходе Манычской операции, обороне Царицына, Харьковской, Перекопско-Чонгарской и многих других героических операций.<br><br><i>Победоносной красной армии - вечная слава!</i>',
      source:'КПТБ, 19 ноября 2021 года',
     },
     {
      name: 'Великая Октябрьская социалистическая революция',
      photo: 'images/october_flag',
      discription:'Здравствуйте, товарищи!<br><br>104 года назад, 7 ноября, произошло великое событие - свершилась Великая Октябрьская Социалистическая Революция! Это день, когда трудовой народ восстал и завоевал свободу! Революция изменила весь ход мировой истории!<br><br>Революция показала, что рабочие могут сами вершить свою судьбу и в состоянии добыть себе свободу. Великий подвиг Октября не будет последним!<br><br>Предлагаем вам ознакомится с <a href="7november.html">нашей статьей об этих судьбоносных событиях на нашем сайте</a>!<br><br>Ура, товарищи! Слава великому Октябрю, вдохновителю побед рабочего класса!',
      source:'КПТБ, 7 ноября 2021 года.',
     },
     {
      name: 'Михаил Фрунзе об основе всего',
      photo: 'images/frunze',
      discription:'Милый Костя, экономика это основа всего , мы будем с тобой лечить больного , а через год или через месяц он погибнет от голода , от грязи , от холода в своем убогом жилье. Лечить надо глубже изменить всю жизнь, чтобы не было бедности и лишений ни у кого никогда, я не хочу сказать себя на склоне лет вот и прожита жизнь , а к чему?',
      source:'Письмо Михаила Васильевича Фрунзе брату Константину.',
     },
     {
      name: 'ПИСЬМО В ДЕТИЗДАТ ПРИ ЦК ВЛКСМ',
      photo: 'images/stalinUndWoroschilow',
      discription:'Я решительно против издания "Рассказов о детстве Сталина".<br><br>Книжка изобилует массой фактических неверностей, искажений, преувеличений, незаслуженных восхвалений. Автора ввели в заблуждение охотники до сказок, брехуны (может быть, "добросовестные" брехуны), подхалимы. Жаль автора, но факт остается фактом.<br><br>Но это не главное. Главное состоит в том, что книжка имеет тенденцию вкоренить в сознание советских детей (и людей вообще) культ личностей, вождей, непогрешимых героев. Это опасно, вредно. Теория "героев" и "толпы" есть не большевистская, а эсеровская теория. Герои делают народ, превращают его из толпы в народ - говорят эсеры. Народ делает героев - отвечают эсерам большевики. Книжка льет воду на мельницу эсеров. Всякая такая книжка будет лить воду на мельницу эсеров, будет Вредить нашему общему большевистскому делу.<br><br>Советую сжечь книжку.',
      source:'Иосиф Виссарионович Сталин, 16 февраля 1938 года.',
     },
     {
      name: 'О принципах коммунистической пропаганды и агитации',
      photo: 'images/veveLaInternationale',
      discription:'Чтобы завоевать симпатии полупролетарских слоев трудящихся на сторону революционного пролетариата, коммунисты должны использовать их особые классовые противоречия по отношению к помещикам, капиталистам и капиталистическому государству и путем постоянного убеждения освободить эти промежуточные слои от их недоверия к пролетарской революции. Это часто будет требовать продолжительного общения с ними. Проникновенный интерес к их жизненным потребностям; безвозмездная информация и помощь при мелких трудностях, которые им приходится преодолевать, но перед которыми они сами беспомощны; вовлечение их в особые учреждения, предназначенные для их безвозмездного просвещения, укрепят их доверие к коммунистическому движению. При этом необходимо осторожно, но неустанно оказывать противодействие враждебным организациям и лицам, пользующимся в данной местности авторитетом или влиянием среди трудящихся: мелких крестьян, кустарей и других полупролетарских элементов. Те враги, которых трудящиеся на собственном опыте знают как эксплуататоров, должны быть разоблачены как представители и олицетворение всего преступного капиталистического строя. Все повседневные события, в которых обнаруживается конфликт между государственной бюрократией и идеалами мелкобуржуазной демократии и «правового государства», должны быть интенсивно и в популярной форме использованы в коммунистической пропаганде и агитации.Чтобы завоевать симпатии полупролетарских слоев трудящихся на сторону революционного пролетариата, коммунисты должны использовать их особые классовые противоречия по отношению к помещикам, капиталистам и капиталистическому государству и путем постоянного убеждения освободить эти промежуточные слои от их недоверия к пролетарской революции. Это часто будет требовать продолжительного общения с ними. Проникновенный интерес к их жизненным потребностям; безвозмездная информация и помощь при мелких трудностях, которые им приходится преодолевать, но перед которыми они сами беспомощны; вовлечение их в особые учреждения, предназначенные для их безвозмездного просвещения, укрепят их доверие к коммунистическому движению. При этом необходимо осторожно, но неустанно оказывать противодействие враждебным организациям и лицам, пользующимся в данной местности авторитетом или влиянием среди трудящихся: мелких крестьян, кустарей и других полупролетарских элементов. Те враги, которых трудящиеся на собственном опыте знают как эксплуататоров, должны быть разоблачены как представители и олицетворение всего преступного капиталистического строя. Все повседневные события, в которых обнаруживается конфликт между государственной бюрократией и идеалами мелкобуржуазной демократии и «правового государства», должны быть интенсивно и в популярной форме использованы в коммунистической пропаганде и агитации.<br><br>12 июля 1921 г.,',
      source:'По тексту книги «Тезисы и резолюции III конгресса Коммунистического Интернационала», М., 1921',
     },
     {
      name: 'Карл Маркс и Фридрих Энгельс о частной собственности',
      photo: 'images/marxAndEngels',
      discription:'Вы приходите в ужас от того, что мы хотим уничтожить частную собственность. Но в вашем нынешнем обществе частная собственность уничтожена для девяти десятых его членов. Она существует именно благодаря тому, что не существует для девяти десятых.',
      source:'Карл Маркс, Фридрих Энгельс',
     },
     {
      name: 'День Освобождения Украины',
      photo: 'images/freeUkraine',
      discription:'Добрый день, товарищи.<br><br>Сегодня, 28 октября, годовщина освобождения Украинской ССР от немецко-фашистских захватчиков. Оно связано с окончанием последней военной операции на территории Украинской ССР  "Восточно - Карпатской".<br><br>Сегодня граждане Украины возложат венки настоящим Героям-освободителям, настоящим борцам за человеческую свободу.<br><br>Несмотря на буржуазную пропаганду многие люди по прежнему чтят память наших Героев , а не всяких бандер и шухевичей, развязавших бандитский террор против собственных соотечественников.<br><br>Но если мы будем бездействовать, если не будем распространять историческую правду, то под напором буржуазной пропаганды людей, которые почитают подвиг настоящих героев, увы будет становиться всё меньше и меньше.<br><br>Слава Освободителям!!!',
      source:'КПТБ, 28 октября 2021 года',
     },
     {
      name: 'О лозунге Соединенные Штаты Европы',
      photo: 'images/leninVystup',
      discription:'Неравномерность экономического и политического развития есть безусловный закон капитализма. Отсюда следует, что ВОЗМОЖНА победа социализма первоначально в немногих или даже В ОДНОЙ, ОТДЕЛЬНО ВЗЯТОЙ, капиталистической стране. Победивший пролетариат этой страны, экспроприировав капиталистов и ОРГАНИЗОВАВ У СЕБЯ социалистическое производство, встал бы против остального, капиталистического мира, привлекая к себе угнетенные классы других стран, поднимая в них восстание против капиталистов, выступая в случае необходимости даже с военной силой против эксплуататорских классов и их государств.',
      source:'Владимир Ильич Ленин, «О лозунге Соединенные Штаты Европы», 1915',
     },
     {
      name: 'С чего начать?',
      photo: 'images/lelenin',
      discription:'Смешно ссылаться на различие обстановки, на смену периодов: работать над созданием боевой организации и ведением политической агитации обязательно при какой-угодно «серой, мирной» обстановке, в период какого-угодно «упадка революционного духа» — более того: именно при такой обстановке и в такие периоды особенно необходима указанная работа, ибо в моменты взрывов и вспышек поздно уже создавать организацию; она должна быть наготове, чтобы сразу развернуть свою деятельность. «Изменить в 24 часа тактику»! Да для того, чтобы изменить тактику, надо прежде иметь тактику, а если нет крепкой организации, искушенной в политической борьбе при всякой обстановке и во всякие периоды, то не может быть и речи о том систематическом, освещенном твердыми принципами и неуклонно проводимом плане деятельности, который только и заслуживает названия тактики.',
      source:'Владимир Ильич Ленин, "С чего начать?", создание - май 1901 года.  ПСС Т 5, стр. 1-13.',
     },
     {
      name: 'Советская власть',
      photo: 'images/manifestation',
      discription:'Советская власть на сегодняшний день есть наиболее справедливая, наиболее открытая к народу форма власти, ибо Советское государство выражало интересы трудящихся, то есть подавляющего большинства всего народа. Советская власть потому была властью демократической, поскольку выражала интересы трудового народа, а не горстки экплуататоров, жуликов и бандитов. Отрицать демократичность Советской власти, противопоставлять Советской демократии демократию буржуазную, на деле значит выступать против демократии трудящихся и социализма, и стоять за демократию для богатых. Третьего не дано.',
      source:'КПТБ, 15 октября 2021 года.',
     },
     {
      name: 'Карл Маркс о праве и его происхождении',
      photo: 'images/marxUndEngels',
      discription:'"Ваше право есть лишь возведенная в закон воля вашего класса, воля, содержание которой определяется материальными условиями жизни вашего класса."',
      source:'Карл Маркс и Фридрих Энгельс, "Манифест Коммунистической партии"',
     },
     {
      name: 'Образование Китайской Народной Республики',
      photo: 'images/maoZedong',
      discription:'Товарищи, 1 октября 1949 года товарищ Мао Цзэдун в Пекине на площади Тяньаньмэнь провозгласил об образовании Китайской Народной Республики, что стало завершающим актом в изгнании иностранных захватчиков с китайской земли и победой коммунистов в гражданской войне в Китае. Китайский народ, водимый КПК, смог отстоять свою свободу и независимость, а также установить власть рабочих в Китае, повторив бессмертный подвиг Октябрьской революции.<br><br>Пролетарии всех стран, соединяйтесь!',
      source:'КПТБ, 1 октября 2021 года.',
     },
     {
      name: 'Ефим Афанасьевич Щаденко',
      photo: 'images/efimShadenko',
      discription:'27 сентября 1885 года в станице Каменская Донецкого округа родился Ефим Афанасьевич Щаденко . Никто ещё не знал, что будущее этого мальчишки будет настолько насыщенным и интересным. Сын обычного рабочего стал портным, благодаря чему ощутил всю боль пролетариата живущего в Российской империи. В 1904 году вступил в социал-демократическую партию Пятигорска.<br>Во времена революции 1905-1907 годов жил в Баку, где организовал забастовку продлившуюся около 2 месяцев.<br>В 1913 за бурную революционную деятельность осуждён на два года заключения в темнице города Армавира.<br>В августе 1914 спасён Драгунским кавалерийским дивизионом, разбившим охрану. Щаденко удалось познакомиться с таким же будущим героем благодаря,  которому почти столетие слово пролетариат ценилось и властью, и народом - Семёном Михайловичем Будённым.<br>С февраля 1917 года председатель Каменского комитета РСДРП(Б).<br>Организовал отряды красной армии в Каменском, разгромившие белых на Дону.<br>В январе 1918 был избран членом Донского военно-революционного комитета.<br>В ходе гражданственной войны был ранен в плечо и руку. На время лечения его полками управлял не мало известный Климент Ефремович Ворошилов.  С выздоровлением Щаденко вновь рвался на фронт. За короткие сроки создал огромную, обозлённую на буржуазную власть, армию. За участие в гражданственной войне был лично награждён золотыми часами.<br>В октябре 1920 отправлен в оздоровительный санаторий Москвы.<br>Один из создателей первой конной армии.<br>С 30 по 34 член ЦКК.С 39 по 41 член ЦК ВКП(Б).<br>Во времена Великой Отечественной войны принял участия во многих решающих сражениях против фашистов и был награждён медалями "За победу над Германией", "За оборону Москвы" и "За оборону Сталинграда".<br>6 сентября 1951 года чуть чуть не дожив до своего день рождения умер от старости.<br>Ни когда не забудем этого героя. Г.К. Жуков о нем говорил: <i>"это был требовательный человек и умелый организатор"</i>.',
      source:'КПТБ, 27 сентября 2021 года.',
     },
     {
      name: 'Иосиф Сталин о буржуазных выборах',
      photo: 'images/stalinVybor',
      discription:'«Дума только на словах будет обладать решающим голосом, на деле же у неё будет лишь совещательный голос, ибо в качестве цензоров над нею будут стоять верхняя палата и вооружённое до зубов правительство. В манифесте прямо говорится, что ни одно постановление Думы не может быть проведено в жизнь, если его не одобрят верхняя палата и царь.<br>Дума не является народным парламентом, это парламент врагов народа, ибо выборы в Думу не будут ни всеобщими, ни равными, ни прямыми, ни тайными».',
      source:'Иосиф Виссарионович Сталин, т.1, с. 207',
     },
     {
      name: 'Ленин о марксистской науке',
      photo: 'images/marxism_nauka',
      discription:'"История философии и история социальной науки показывают с полной ясностью, что в марксизме нет ничего похожего на “сектантство” в смысле какого-то замкнутого, закостенелого учения, возникшего в стороне от столбовой дороги развития мировой цивилизации. Напротив, вся гениальность Маркса состоит именно в том, что он дал ответы на вопросы, которые передовая мысль человечества уже поставила. Его учение возникло как прямое и непосредственное продолжение учения величайших представителей философии, политической экономии и социализма. Учение. Маркса всесильно, потому что оно верно. Оно полно и стройно, давая людям цельное миросозерцание, непримиримое ни с каким суеверием, ни с какой реакцией, ни с какой защитой буржуазного гнета."<br><i>В. И. Ленин "Три Источника и составных части марксизма".</i><br><br>В общем о явление науки марксизма и его методе.<br>Из цитаты элементарно следует, что марксизм нужно понимать как науку и ничто другое. Что полностью опровергает его сравнение или даже намёки на схожесть с религией.<br>Марксизм- есть гибкая наука, а не строгая дома идеологий.',
      source:'КПТБ, 22 сентября 2021 года.',
     },
     {
      name: 'Сталин о "левом" уклоне',
      photo: 'images/stalin_o_levom_uklone',
      discription:'Но если троцкистская тенденция представляет "левый" уклон, не значит ли это, что "левые" стоят левее ленинизма? Нет, не значит. Ленинизм есть самое левое (без кавычек) течение в мировом рабочем движении. Мы, ленинцы, входили во II Интернационал до периода начала империалистической войны как крайняя левая фракция социал-демократов. Мы не остались во II Интернационале и мы проповедовали раскол во II Интернационале потому, что мы именно как крайняя левая фракция не хотели жить в одной партии с мелкобуржуазными изменниками марксизма, с социал-пацифистами и социал-шовинистами.<br><br>Эта тактика и эта идеология легли впоследствии в основу большевистских партий всего мира. В своей партии мы, ленинцы,-единственные левые без кавычек. Поэтому мы, ленинцы, не "левые" и не правые в своей собственной партии. Мы - партия марксистов-ленинцев. И мы боремся в своей партии не только с теми, кого мы называем открыто оппортунистическими уклонистами, но и с теми, которые хотят быть "левее" марксизма, "левее" ленинизма, прикрывая "левыми", трескучими фразами свою правую, оппортунистическую природу.<br><br>Всякий поймёт, что когда людей, не освободившихся еще от троцкистских тенденций, называют "левыми", то это надо понимать иронически. Ленин называл "левых коммунистов" левыми, иногда в кавычках, иногда без кавычек. Но всякий поймёт, что левыми называл их Ленин иронически, подчёркивая этим, что левые они только на словах, по видимости, а на деле представляют мелкобуржуазные правые тенденции.',
      source:'Иосиф Виссарионович Сталин, "Правда" № 273, 24 ноября 1928 г.',
     },
     {
      name: 'Первая стачка в России',
      photo: 'images/pervaa_stachka_v_rossii',
      discription:'1885 год. Первая крупная стачка рабочих Царской России. 7 января Рабочие Морозовской фабрики организованно выступают против бесчеловечных условий труда на предприятии.<br><br>Причиной стачки послужило резкое ухудшение положения рабочих в результате промышленного кризиса начала 1880-х годов, а также жестокая эксплуатация со стороны владельцев фабрики. В частности, с 1882 по 1884 год пять раз снижалась заработная плата, были введены высокие штрафы, составлявшие в среднем четверть заработной платы и доходившие порой до половины заработка.<br><br>Основными требованиями бастующих было повышение заработной платы до уровня 1880—1882 года, сокращение штрафов до 5 % заработка и общее облегчение положения рабочих.<br>Организаторами и руководителями стачки были рабочие Никольской мануфактуры П. А. Моисеенко и В. С. Волков.<br>11 января Волков вручил владимирскому губернатору «Требования по общему согласию рабочих», в которых содержался пункт об учреждении государственного контроля над фабрикантами, а также и о принятии законодательных изменений в условия найма.<br><br>В забастовке приняло участие около 8 тысяч из 11 тысяч рабочих мануфактуры. В результате забастовка была жестоко подавлена 3 батальонами солдат и 6 сотнями казаков.<br>Было арестованы свыше 600 рабочих, и по решению суда отпущены. Однако вопреки решению суда и самоуправству около 800 рабочих были высланы на родину под надзор полиции.',
      source:'КПТБ, 21 сентября 2021 года.',
    },
    {
      name: 'Ленин о разрыве между теорией и практикой',
      photo: 'images/zadachi_soyuzov_molodezhy',
      discription:'Одно из самых больших зол и бедствий, которые остались нам от старого капиталистического общества, это полный разрыв книги с практикой жизни, ибо мы имели книги, где все было расписано в самом лучшем виде, и эти книги, в большинстве случаев, являлись самой отвратительной лицемерной ложью, которая лживо рисовала нам капиталистическое общество.<br><br>Поэтому простое книжное усвоение того, что говорится в книгах о коммунизме, было бы в высшей степени неправильным. Теперь в наших речах и статьях нет простого повторения того, что говорилось раньше о коммунизме, так как наши речи и статьи связаны с повседневной и всесторонней работой. Без работы, без борьбы книжное знание коммунизма из коммунистических брошюр и произведений ровно ничего не стоит, так как оно продолжало бы старый разрыв между теорией и практикой, тот старый разрыв, который составлял самую отвратительную черту старого буржуазного общества.',
      source:'Владимир Ильич Ленин, "Задачи союзов молодёжи"',
    },
    {
      name: 'Освободительный поход РККА',
      photo: 'images/pohodRKKA',
      discription:'Здравствуйте, Товарищи!<br><br>В этот день, 17 сентября 1939 года, состоялся освободительный поход Советской Красной Рабоче-Крестьянской Армии западноукраинских и западнобелорусских земель от польского гнета. Во время польской оккупации украинского и белорусского пролетарии беспощадно эксплуатировались польскими капиталистами, качество жизни восточных районов Польши была значительно меньше, чем качество жизни в Кракове или Варшаве. Кроме этого, западные украинцы и белорусы еще испытывали уничтожения своего языка, веры и культуры. В это время шла активная полонизация и насаждения католической веры.<br><br>Но, все же, объединившись с СССР, наши народы смогли вступить в период развития. Советская власть ликвидировала безграмотность, построила школы, заводы, колхозы, передовые отрасли промышленности. В советское время Западная Украина имела один из самых высоких уровней жизни в Союзе.<br><br>Но сейчас, к сожалению, современные капиталистические Украина и Беларусь претерпевают нищету, безработицу и отсутствие перспективы в родной стране заставляют молодежь искать лучшей доли за рубежом. Даже сейчас, Украина и Беларусь все чаще подвергаются влиянию американского и польского империализма. Украина практически ничего уже сама не решаю, она находится в долговой зависимости перед западными странами.<br><br>Возможно, даже и возвращение захватчиков. Польская буржуазия может воспользоваться слабостью стран в критический момент. Особенно это слышно в Беларуси, где практически все лидеры так называемые "оппозиции" имеют связи с правящим классом Варшавы.<br><br>В этот момент, товарищи, нам нужно объединяться вокруг наших классовых интересов, потому что никто, кроме нас не даст нам свободы. Пролетарии всех стран, соединяйтесь!',
      source:'КПТБ, 17 сентября 2021 года.',
    },
    {
      name: 'К ГРАЖДАНАМ РОССИИ!',
      photo: 'images/grazhdanamRossii',
      discription:'Временное правительство низложено. Государственная власть перешла в руки органа Петроградского Совета рабочих и солдатских депутатов, Военно-революционного комитета, стоящего во главе петроградского пролетариата и гарнизона.<br><br>Дело, за которое боролся народ: немедленное предложение демократического мира, отмена помещичьей собственности на землю, рабочий контроль над производством, создание Советского правительства — это дело обеспечено.<br><br>Да здравствует революция рабочих, солдат и крестьян!<br><br>Военно-Революционный Комитет при Петроградском Совете Рабочих и Солдатских Депутатов',
      source:'25 октября 1917 г. 10 ч. утра. Написано Владимиром Ильичем Лениным.',
    },
    {
      name: 'Путч в Чили 11 сенбря 1973 года',
      photo: 'images/chili',
      discription:'Здравствуйте, товарищи.<br>В этот день, 11 сентября 1973 в Чили был осуществлен кровавый буржуазный военный переворот при поддержке США. Был убит борец за свободу, коммунист, Сальвадор Альенде. В этот день установилась фашистская диктатура Августо Пиночета, во временна которой было уничтожено более 40 тысяч невинных человек. Данное событие красноречиво показывает на что готова буржуазия ради удержания своей власти для продолжения нещадной эксплуатации трудящихся. Опыт Альенде показывает, что хоть и прийти коммунистам к власти путем буржуазных выборов иногда представляется возможно, но удержать власть без того, чтобы раз и навсегда уничтожить класс эксплуататоров увы не удастся.<br>Вечная память товарищу Альенде и всем невинно убиенным. Пролетарии всех стран, соединяйтесь.',
      source:'КПТБ, 11 сентября 2021 года.',
    },
    {
      name: 'Максим Горький о Сталине',
      photo: 'images/m_gorki',
      discription:'...Непрерывно и все быстрее растет в мире значение Иосифа Сталина, человека, который, наиболее глубоко освоив энергию и смелость учителя и товарища своего, вот уже десять лет достойно замещает его на труднейшем посту вождя партии. Он глубже всех других понял: подлинно и непоколебимо революционно-творческой может быть только истинно и чисто пролетарская, прямолинейная энергия, обнаруженная и воспламененная Лениным.',
      source:'Максим Горький, «Правда социализма» (1934)',
    },
    {
      name: 'Энвер Ходжа',
      photo: 'images/enver',
      discription:'«Марксизм-ленинизм — всепобеждающая идеология. Тот, кто воспринимает, защищает и развивает его, тот участник славной армии революции, великой и непобедимой армии истинных коммунистов, которые руководят пролетариатом и всеми угнетенными в борьбе за преобразование мира, за разгром капитализма и построение нового, социалистического мира»<br><br>Энвер Ходжа «Империализм и революция»<br><br>Энвер Ходжа был первым секретарем Албанской партии труда в 1941-1985 гг. и бессменным лидером Албании с 1945 по 1985 гг.<br><br>После ХХ съезда КПСС, где был прочитан доклад Хрущева о «культе личности» Сталина, Э. Ходжа выступил в защиту Сталина. Это вызвало бешенство Хрущёва, и отношение между СССР и Албанией были разорваны.',
      source:'КПТБ, 8 сентября 2021 года.',
    },
    {
      name: 'Василий Чапаев',
      photo: 'images/chapaev',
      discription:'Товарищи, в этот день, 5 сентября 1919 года погиб великий комдив Василий Иванович Чапаев от рук белоказаков на Южном Урале. Он был и остаётся одной из самых известных исторических личностей эпохи Гражданской войны в России. Он положил свою жизнь за дело освобождения рабочего класса. Был верным борцом за дело трудящихся. В честь него была названа 25-ая Чапевская дивизия, которая героически обороняла город-герой Одессу во время Великой Отечественной Войны. Василий Иванович запомнился потомкам как стойкий, мужественный, но добрый сердцем человек.<br>Вечная слава Герою!',
      source:'КПТБ, 5 сентября 2021 года.',
    },
    {
      name: 'О слове "товарищ"',
      photo: 'images/leninTovarisch',
      discription:'Наше слово гордое «товарищ»<br>Нам дороже всех красивых слов.<br>С этим словом мы повсюду дома,<br>Нет для нас ни черных, ни цветных,<br>Это слово каждому знакомо,<br>С ним везде находим мы родных.',
      source:'Василий Лебедев-Кумач, Исаак Дунаевский. "Песня о Родине"',
    },
    {
      name: 'КАК НАВСЕГДА СПАСТИ ТРУДЯЩИХСЯ ОТ ГНЕТА ПОМЕЩИКОВ И КАПИТАЛИСТОВ',
      photo: 'images/leninAndPeople',
      discription:'Враги трудящихся — помещики и капиталисты — говорят: рабочие и крестьяне не смогут прожить без нас. Без нас некому будет установить порядка, распределить работу, принудить к труду. Без нас всё развалится, и государство распадётся. Нас прогнали, но разруха снова вернёт нас к власти.<br><br>Такие речи помещиков и капиталистов не смутят, не запугают, не обманут рабочих и крестьян. В армии необходима самая строгая дисциплина. И, однако, сознательные рабочие сумели объединить крестьян, сумели взять себе на службу старых царских офицеров, сумели создать победоносную армию.<br>Красная Армия создала невиданно твёрдую дисциплину не из-под палки, а на основе сознательности, преданности, самоотвержения самих рабочих и крестьян.<br><br>И вот — чтобы навсегда спасти трудящихся от гнёта помещиков и капиталистов, от восстановления их власти, — надо создать великую красную армию труда. Она будет непобедима, если в ней будет трудовая дисциплина. Рабочие и крестьяне должны доказать, и они докажут, что правильное распределение труда, что беззаветную дисциплину и преданность в труде на общую пользу — они сумеют наладить сами без помещиков и против помещиков, без капиталистов и против капиталистов.<br>Трудовая дисциплина, бешеная энергия в труде, готовность на самопожертвование, тесный союз крестьян с рабочими — вот что спасёт трудящихся навсегда от гнёта помещиков и капиталистов.',
      source:'Владимир Ильич Ленин, июнь 1919',
    },
    {
      name: 'Гордое имя - Коммунист',
      photo: 'images/redSoldierFlag',
      discription:'Мало назваться коммунистом. Чтобы им быть, необходимо много учиться, а еще больше - строить компартию, которая честно и последовательно отстаивает интересы трудящихся. Мало слепо идти за вождями трудящихся, необходимо анализировать их слова и действия, учиться у них упорству, воле и преданности.<br><br>Без сознательности, научности, идейного единства и твёрдой дисциплины невозможно организовать ту партию, которая будет вести трудящихся всего мира на борьбу против эксплуататоров.',
      source:'КПТБ, 24 августа 2021 года.',
    },
    {
      name: 'Источник силы и залог неизбежной полной победы коммунизма',
      photo: 'images/leninAndComrades',
      discription:'Поменьше политической трескотни, побольше внимания самым простым, но живым, из жизни взятым, жизнью проверенным фактам коммунистического строительства — этот лозунг надо неустанно повторять всем нам, нашим писателям, агитаторам, пропагандистам, организаторам и так далее.<br><br>Естественно и неизбежно, что первое время после пролетарской революции нас занимает более всего главная и основная задача, преодоление сопротивления буржуазии, победа над эксплуататорами, подавление их заговора (вроде «заговора рабовладельцев» о сдаче Питера, в каковом заговоре участвовали все от черной сотни и кадетов до меньшевиков и эсеров включительно). Но рядом с этой задачей столь же неизбежно выдвигается — и чем дальше, тем больше — более существенная задача положительного коммунистического строительства, творчества новых экономических отношений, нового общества.<br><br>Диктатура пролетариата, — как мне приходилось уже не раз указывать, между прочим и в речи 12 марта на заседании Петроградского Совдепа, — не есть только насилие над эксплуататорами и даже не главным образом насилие. Экономической основой этого революционного насилия, залогом его жизненности и успеха является то, что пролетариат представляет и осуществляет более высокий тип общественной организации труда по сравнению с капитализмом. В этом суть. В этом источник силы и залог неизбежной полной победы коммунизма.',
      source:'Владимир Ильич Ленин, "Великий почин, 1919"',
    },
    {
      name: 'Рабочие в России',
      photo: 'images/workers',
      discription:'Маркс еще в 1844 году в экономическо-философских рукописях отметил, что<br>...пролетария, т.е. того, кто, не обладая ни капиталом, ни земельной рентой, живет исключительно трудом, и притом односторонним, абстрактным трудом, политическая экономия рассматривает только как рабочего.<br><br>К вопросу о том, что в России нет рабочих:<br><br>Самый большой отряд работников наемного труда — это квалифицированные рабочие промышленных предприятий, строительства, транспорта, связи, геологии и разведки недр — на 2014 г. их численность составляет 9,4 млн. человек (последние доступные данные в данном разрезе). В рядах индустриальных рабочих средней квалификации, куда входят операторы, аппаратчики, машинисты установок и машин, насчитывается 8,7 млн. К категории неквалифицированных рабочих Росстат относит 7 млн. Таким образом, мы можем отнести к индустриальному рабочему классу примерно 25 млн. — 35% всех занятых в стране. Это больше численности индустриального рабочего класса всего Советского Союза в 1940 г.<br><br>Около 10 млн. рабочих постсоветской России трудятся в торговле, бытовом обслуживании, жилищно-коммунальном хозяйстве. Вместе с ними общая численность городского рабочего класса составляет более 35 млн. человек.',
      source:'<a href="https://popecon.ru/otrivki/418-skolko-rabochih-v-rossii-chislennost-i-struktura.html">Сколько рабочих в России: численность и структура</a>',
    },
    {
      name: 'Задача настоящих коммунистов',
      photo: 'images/leninParade',
      discription:'<i>"...при неслыханной распространенности искажений марксизма, наша задача состоит прежде всего в восстановлении истинного учения Маркса о государстве."</i><br><br>Владимир Ильич Ленин, "Государство и революция ", 1917<br><br>Задача настоящих коммунистов сегодня, марксистов-ленинцев, не изменилась. Сегодня, как и сто лет назад, многие социалисты и псевдокоммунисты нагло подыгрывают буржуазии, стремятся во что бы то ни стало исказить, опошлить и затушевать революционные идеи марксизма. Не выйдет!<br>Рабочее движение должно подняться, вырастить своих лидеров и добиться победы над классом буржуазии. И оно поднимется, вырастит и добьётся! Рабочее движение будет развиваться тем быстрее, чем быстрее товарищи осознают необходимость (1) занятий в марксистских кружках, (2) всестороннего изучения марксистской науки, и, наконец, (3) построения партии рабочего класса без идеализма, ревизионизма и прочих мелкобуржуазных идей.',
      source:'КПТБ, 16 августа 2021 года.',
    },
    {
      name: 'Когда мы научимся побеждать?',
      photo: 'images/leninRev',
      discription:'...только тогда мы научимся побеждать, когда мы не будем бояться признавать свои поражения и недос­татки, когда мы будем истине, хотя бы и самой печальной, смотреть прямо в лицо.',
      source:'Владимир Ильич Ленин',
    },
    {
      name: 'Владимир Ленин',
      photo: 'images/maxGorki',
      discription:'Должность честных вождей народа — нечеловечески трудна. Невозможен вождь, который — в той или иной степени — не был бы тираном. Вероятно, при Ленине перебито людей больше, чем при Уот Тайлоре, Фоме Мюнцере, Гарибальди. Но ведь и сопротивление революции, возглавляемой Лениным, было организовано шире и мощнее. К тому же надо принять во внимание, что с развитием «цивилизации» ценность человеческой жизни явно понижается, о чем неоспоримо свидетельствует развитие в современной Европе техники истребления людей и вкуса к этому делу.<br><br>Но скажите голосом совести: насколько уместно и не слишком ли отвратительно лицемерие тех «моралистов», которые говорят о кровожадности русской революции, после того как они, в течение четырех лет позорной общеевропейской бойни, не только не жалели миллионы истребляемых людей, но всячески разжигали «до полной победы» эту мерзкую войну? Ныне культурные нации оказались разбиты, истощены, дичают, а победила общечеловеческая глупость: тугие петли ее и по сей день душат людей.<br><br>Человек изумительно сильной воли, Ленин был во всем остальном типичным русским интеллигентом. Он в высшей степени обладал качествами, свойственными лучшей русской интеллигенции, — самоограничением, часто восходящим до самоистязания, самоуродования, до рахметовских гвоздей, отрицания искусства, до логики одного из героев Л.Андреева: «Люди живут плохо — значит, я тоже должен плохо жить».<br><br>В тяжелом, голодном 19-м году Ленин стыдился есть продукты, которые присылали ему товарищи, солдаты и крестьяне из провинции. Когда в его неуютную квартиру приносили посылки, он морщился, конфузился и спешил раздать муку, сахар, масло больным или ослабевшим от недоедания товарищам.<br>Приглашая меня обедать к себе, он сказал:<br>— Копченой рыбой угощу — прислали из Астрахани.<br>И, нахмурив сократовский лоб, скосив в сторону всевидящие глаза, добавил:<br> — Присылают, точно барину. Как от этого отвадишь? Отказаться, не принять — обидишь. А кругом все голодают. Ерунда.',
      source:'Максим Горький, "Владимир Ленин"',
    },
    {
      name: 'Особая роль Советской власти',
      photo: 'images/stalinHand',
      discription:'Особая роль Советской власти объясняется двумя обстоятельствами: во-первых, тем, что Советская власть должна была не заменить одну форму эксплуатации другой формой, как это было в старых революциях, а ликвидировать всякую эксплуатацию; во-вторых, тем, что ввиду отсутствия в стране каких-либо готовых зачатков социалистического хозяйства, она должна была создать, так сказать, на "пустом месте" новые, социалистические формы хозяйства. <br> Задача эта безусловно трудная и сложная, не имеющая прецедентов. Тем не менее, Советская власть выполнила эту задачу с честью. Но она выполнила ее не потому, что будто бы уничтожила существующие экономические законы и "сформировала" новые, а только лишь потому, что она опиралась на экономический закон обязательного соответствия производственных отношений характеру производительных сил.',
      source:'Иосиф Виссарионович Сталин, "Экономические проблемы социализма в СССР"',
    },
    {
      name: 'Исторический материализм Маркса',
      photo: 'images/lelin',
      discription:'Углубляя и, развивая философский материализм, Маркс довел его до конца, распространил его познание природы на познание человеческого общества. Величайшим завоеванием научной мысли явился исторический материализм Маркса. Хаос и произвол, царившие до сих пор во взглядах на историю и на политику, сменились поразительно цельной и стройной научной теорией, показывающей, как из одного уклада общественной жизни развивается, вследствие роста производительных сил, другой, более высокий, — из крепостничества, например, вырастает капитализм.',
      source:'Владимир Ильич Ленин, "Три источника и три составных части марксизма", 1913',
    },
    {
      name: 'Усиление общественной власти',
      photo: 'images/youngEngels',
      discription:'Общественная власть усиливается по мере того, как обостряются классовые противоречия внутри государства, и по мере того, как соприкасающиеся между собой государства становятся больше и населённее.',
      source:'Фридрих Энгельс',
    },
    {
      name: 'Настоящая дружба',
      photo: 'images/friendship',
      discription:'При капитализме человек человеку - волк, а при коммунизме - друг, товарищ и брат! Так давайте же, товарищи, крепить братство и союзнические отношения в левом движении. Порознь мы слабы, но вместе, объединенные под предводительством авангарда пролетариата - коммунистической партии, мы великая сила, класс гегемон, способный построить новый справедливый мир без эксплуатации. Вступайте же и вы в нашу партию! <br> Пролетарии всех стран, соединяйтесь!',
      source:'МПТБ, 30 июля 2021 года.',
    },
    {
      name: 'Советские спортсмены',
      photo: 'images/sovietSport',
      discription:'Советские спортсмены шли с красным флагом, олицетворяющим пролитую кровь рабочих всех стран в борьбе с тиранами и палачами. За этим флагом стояла сила побед, упорство и мужество. За этим флагом стояли спортсмены-победители. За этим флагом стояла сильная необъятная страна, построенная на коллективизме и дружбе народов! А что стоит за сегодняшним белым флагом российских спортсменов?',
      source:'КПТБ, 28 июля 2021 года.',
    },
    {
      name: 'Сталин о заслугах Ленина',
      photo: 'images/leninStalin',
      discription:'Величайшая заслуга Ленина перед русским пролетариатом и его партией состоит в том, что он раскрыл всю опасность меньшевистского организационного "плана" еще в тот момент, когда "план" был едва зачат, когда сами авторы "плана" с трудом представляли ясно его очертания, и, раскрыв его, открыл бешеную атаку против организационной распущенности меньшевиков, сосредоточив все внимание практиков на этом вопросе. Ибо речь шла о существовании партии, о жизни и смерти партии. <br> Поставить общерусскую политическую газету, как центр стягивания партийных сил, организовать стойкие партийные кадры на местах, как "регулярные части" партии, собрать эти кадры воедино через газету и сплотить их в общерусскую боевую партию с резко обозначенными границами, с ясною программой, твердой тактикой, единой волей, - вот какой план развил Ленин в своих знаменитых книжках: "Что делать?", "Шаг вперед, два назад" 3. Достоинство этого плана состояло в том, что он вполне отвечал русской действительности и мастерски обобщал организационный опыт лучших практиков. В борьбе за этот план большинство русских практиков решительно пошло за Лениным, не останавливаясь перед расколом. Победа этого плана заложила фундамент той сплоченной и закаленной коммунистической партии, равной которой не знает мир.',
      source:'КПТБ, 27 июля 2021 года.',
    },
    {
      name: 'Владимир Ильич Ленин, ТРИ ИСТОЧНИКА И ТРИ СОСТАВНЫХ ЧАСТИ МАРКСИЗМА',
      photo: 'images/leninMarx',
      discription:'Учение Маркса вызывает к себе во всем цивилизованном мире величайшую вражду и ненависть всей буржуазной (и казенной, и либеральной) науки, - которая видит в марксизме нечто вроде “вредной секты”. Иного отношения нельзя и ждать, ибо “беспристрастной” социальной науки не может быть в обществе, построенном на классовой борьбе. Так или иначе, но вся казенная и либеральная наука защищает наемное рабство, а марксизм объявил беспощадную войну этому рабству. Ожидать беспристрастной науки в обществе наемного рабства — такая же глупенькая наивность, как ожидать беспристрастия фабрикантов в вопросе о том, не следует ли увеличить плату рабочим, уменьшив прибыль капитала.',
      source:'Статья «Три источника и три составных части марксизма» была написана В. И. Лениным к 30-летию со дня смерти Карла Маркса и опубликована в журнале «Просвещение» № 3 за 1913 год',
    },
    {
      name: 'Эрнесто Че Гевара про ошибки Троцкого',
      photo: 'images/chePoster',
      discription:'Я думаю, что фундаментальные вещи, на которых базировался Троцкий, были ошибочными, а его дальнейшие поступки - неправильными, а последние годы - и вовсе темны. Троцкисты не внесли никакого вклада в революционное движение; где они достигли наибольшего - так это в Перу, но и там, в конечном итоге, они провалились, поскольку их методы - плохи.',
      source:'Эрнесто Че Гевара',
    },
    {
      name: 'Ленин об учении Маркса!',
      photo: 'images/leninPoster',
      discription:'С учением Маркса происходит теперь то, что не раз бывало в истории с учениями революционных мыслителей и вождей угнетенных классов в их борьбе за освобождение. Угнетающие классы при жизни великих революционеров платили им постоянными преследованиями, встречали их учение самой дикой злобой, самой бешеной ненавистью, самым бесшабашным походом лжи и клеветы. После их смерти делаются попытки превратить их в безвредные иконы, так сказать, канонизировать их, предоставить известную славу их имени для "утешения" угнетенных классов и для одурачения их, выхолащивая содержание революционного учения, притупляя его революционное острие, опошляя его.',
      source:'Владимир Ильич Ленин, "Государство и революция", ГЛАВА I <br> КЛАССОВОЕ ОБЩЕСТВО И ГОСУДАРСТВО',
    },
    {
      name: 'Идеализм Гегеля',
      photo: 'images/engelsPoster',
      discription:'Гегель был идеалист, т. е. для него мысли нашей головы были не отражениями, более или менее абстрактными, действительных вещей и процессов, а, наоборот, вещи и развитие их были для Гегеля лишь воплотившимися отражениями какой-то «идеи», существовавшей где-то ещё до возникновения мира. Тем самым всё было поставлено на голову, и действительная связь мировых явлений была совершенно извращена.',
      source:'Фридрих Энгельс, "Анти-Дюринг"',
    },
    {
      name: 'Руки прочь от Кубы!',
      photo: 'images/vivaCuba',
      discription:'Руки прочь от Кубы! Viva la Cuba! Viva Fidel Castro! Нет геноцидальной блокаде острова свободы!',
      source:'КПТБ, 19 июля 2021 года.',
    },
    {
      name: 'Сила Коммунизма',
      photo: 'images/communistPower',
      discription:'Сила коммунизма в его неизбежности, в умении нести правду по каждому вопросу и мужественно отстоять её. Сплочение трудящихся всего мира - смертельная угроза для капитала. Для удержания своих богатств и своей власти он пойдёт на все уловки, провокации и откровенное насилие. Но невозможно держать уже отжившее одной лишь силой и ложью. Невозможно встать на пути у прогресса, повернуть его назад. <br>Контрреволюция временно победила, пирует. Но это ненадолго.',
      source:'КПТБ, 16 июля 2021 года.',
    },
    {
      name: 'Сталин об индустриализации страны и правом уклоне',
      photo: 'images/stalinParty',
      discription:'Нельзя без конца, т. е. в продолжение слишком долгого периода времени, базировать Советскую власть и социалистическое строительство на двух разных основах, на основе самой крупной и объединённой социалистической промышленности и на основе самого раздроблённого и отсталого мелкотоварного крестьянского хозяйства. Нужно постепенно, но систематически и упорно переводить сельское хозяйство на новую техническую базу, на базу крупного производства, подтягивая его к социалистической промышленности. Либо мы эту задачу разрешим,-и тогда окончательная победа социализма в нашей стране обеспечена, либо мы от неё отойдём, задачи этой не разрешим, - и тогда возврат к капитализму может стать неизбежным. <br>Вот что говорит на этот счёт Ленин: <br>"Пока мы живём в мелкокрестьянской стране, для капитализма в России есть более прочная экономическая база, чем для коммунизма. Это необходимо запомнить. Каждый, внимательно наблюдавший за жизнью деревни, в сравнении с жизнью города, знает, что мы корней капитализма не вырвали и фундамент, основу у внутреннего врага не подорвали. Последний держится на мелком хозяйстве, и чтобы подорвать его, есть одно средство - перевести хозяйство страны, в том числе и земледелие, на новую техническую базу, на техническую базу современного крупного производства. Такой базой является только электричество. Коммунизм - это есть Советская власть плюс электрификация всей страны" (т. XXVI, стр. 46).',
      source:'Иосиф Виссарионович Сталин, "Об индустриализации страны и о правом уклоне в ВКП(б), 1928"',
    },
    {
      name: 'Максим Горький о религии',
      photo: 'images/Maxim_Gorkiy',
      discription:'Бог выдуман — и плохо выдуман! — для того чтоб укрепить власть человека над людьми, нужен он только человеку-хозяину, а рабочему народу он — явный враг. <br>Основная задача всех церквей была одна и та же: внушать бедным холопам, что для них — нет счастья на земле, оно уготовано для них на небесах, и что каторжный труд на чужого дядю — дело богоугодное. <br> Надо ли говорить о том, что "рай" — очень глупая выдумка жрецов и "отцов церкви", выдумка, назначение которой заплатить людям за адовы мучения на земле мыльным пузырем надежды на отдых в другом месте. <br>Атеистическое наше время, усмехаясь над библейской легендой, считает, что бог — это псевдоним человеческой глупости.',
      source:'Максим Горький о религии',
    },
    {
      name: 'Нас уже 5000!',
      photo: 'images/5000Poster',
      discription:'Здравствуйте, Товарищи! Нас уже 5000! Это серьёзное достижение, которое означает, что мы продолжаем набирать сторонников, коммунистов, объединять их. Мы выражаем огромную благодарность товарищам за доверие и поддержку, за стремление к объединению и учению в марксизме. <br>Наша задача - учить марксизму массы, а прежде всего трудящихся. Просвещение рабочих должно быть непрерывным даже в минуты политического затишья и застоя. Мы должны строить организацию без оппортунистов и ревизионистов, без голословных товарищей, которые личные выгоды ставят выше интересов партии. Мы должны строить организацию, с каждым днем повышая политическую грамотность и сознательность её участников. Нам нужна организация с крепкой и твёрдой дисциплиной, которую не смог бы разрушить самый сильный ураган капитализма. <br> Мы идём и будем идти к этому, чтобы не быть предателями и пустословами в глазах всех товарищей, страдающих от рабства капитализма. Доверие к нашей организации от многих и многих товарищей есть лучшее подтверждение верности нашего пути, а открытие отделов КПТБ по миру положило начало крепкому союзу коммунистов всех стран. <br> Трудящиеся всего мира под единое знамя борьбы за рабочее дело! Капитализм не вечен, и не незыблем - это мы знаем наверняка! Ура, Товарищи!',
      source:'КПТБ, 7 июля 2021 года.',
    },
    {
      name: 'Открытие отдела в Германии',
      photo: 'images/germanLogo',
      discription:'Товарищи! В июне 2021 года Компартия Трудящегося Большинства открыла свой отдел в Германии. <br>В объединении коммунистов и трудящихся всех стран есть наша сила и залог побед. Интернационализм как средство борьбы является необходимым и верным в условиях разгула реакции и национализма. <br>Товарищи из Германии, присоединяйтесь к нам!',
      source:'КПТБ, 3 июля 2021 года.',
    },
    {
      name: 'Марксистско-ленинская теория',
      photo: 'images/marxIdeology',
      discription:'Марксистско-ленинская теория является самой передовой из имеющихся на сегодняшний день. Без настойчивого изучения теории невозможно верно оценивать современные политические события. Без достаточного знания марскистко-ленинской теории можно легко стать жертвой обмана проходимцев и оппортунистов. Без верного применения этой теории, в конце концов, невозможно построить крепкую коммунистическую партию, которая одна только в силах взять курс на построение светлого будущего!',
      source:'КПТБ, 1 июля 2021 года.',
    },
    {
      name: 'Гибель СССР',
      photo: 'images/leninPost',
      discription:'Гибель СССР - не конец борьбы, а только её начало. Это событие не является поводом для опускания рук, оно заставляет взяться с новой силой за дело борьбы рабочих за свое освобождение.',
      source:'КПТБ, 27 июня 2021 года.',
    },
    {
      name: 'Классовые различия',
      photo: 'images/marx',
      discription:'Когда в ходе развития исчезнут классовые различия и все производство сосредоточится в руках ассоциации индивидов, тогда публичная власть потеряет свой политический характер. Политическая власть в собственном смысле слова – это организованное насилие одного класса для подавления другого. Если пролетариат в борьбе против буржуазии непременно объединяется в класс, если путем революции он превращает себя в господствующий класс и в качестве господствующего класса силой упраздняет старые производственные отношения, то вместе с этими производственными отношениями он уничтожает условия существования классовой противоположности, уничтожает классы вообще, а тем самым и свое собственное господство как класса. На место старого буржуазного общества с его классами и классовыми противоположностями приходит ассоциация, в которой свободное развитие каждого является условием свободного развития всех.',
      source:'Карл Маркс и Фридрих Энгельс, Манифест Коммунистической партии. - Соч., т.4, стр. 447.',
    },
    {
      name: 'Партия',
      photo: 'images/leninSbor',
      discription:'Партия – сознательный передовой слой класса его авангард. Сила этого авангарда раз в 10 в 100 раз и более велика, чем его численность. Возможно ли это? Может ли сила сотни превышать силу тысячи? Может и превышает, когда сотня организована. ',
      source:'Владимир Ильич Ленин Полное собрание сочинений, т. 24, с. 34.',
    }
]

let menuLinks = [
  {
    main: 'index.html',
    about: 'about.html',
    posts: 'posts.html',
    articles: 'articles.html',
    serbia: 'https://www.instagram.com/kptb_srb/?hl=ru',
    kirgiz: 'https://www.instagram.com/kekp_kyrgyzstan/?utm_medium=copy_link',
    ukraine: 'https://www.instagram.com/mptb_ukraina/?hl=ru',
    germany: 'https://www.instagram.com/kpam_de/',
    tvorchestvo: 'https://www.instagram.com/souz_proletarskogo_tvorchestva/',
    italy: 'https://www.instagram.com/kptb_italia/',
    newzealand: 'https://www.instagram.com/kptb_nz_aotearoa/',
    videos: 'videos.html',
    joint: 'join.html',
  }
]

let downLinks = [
  {
    name: 'НАШИ КОНТАКТЫ',
    youtube: 'https://www.youtube.com/channel/UCvO2vXE3fLN8W5QiRsMFP6g/featured',
    telegram: 'https://t.me/kptb_org',
    instagram: 'https://www.instagram.com/kptb_russia/?igshid=tzl9uephxohe',
    vk: 'https://vk.com/club180844773',
  }
]

const containe = document.querySelector('.containe');
    let content1 = blocks.map(block => `
        <div class="item">
            <img src="${block.photo}\.jpg" class="photo" alt="photo">
            <h2>${block.name}</h2>
            <div class="info"><p>${block.discription}</p></div>
            <br>
            <i>${block.source}</i>
        </div>
    `);

containe.innerHTML = content1.join('');


const menu = document.querySelector('.menu');

let content2 = menuLinks.map(link => `
    <ul>
        <li class="logo"><a href="${link.main}"><img src="images/kptbIcon.jpg" class="kptbIcon" alt="kptbIcon"></a></li>
        <li><a href="${link.main}">Главная страница</a></li>
        <li><a href="${link.about}">О нас</a></li>
        <li><a href="#">Новости</a>
            <ul lass="dropdown">
                <li><a href="${link.posts}">Посты</a></li>
                <li><a href="${link.articles}">Статьи</a></li>
            </ul>
        </li>
        <li><a href="#">Наши отделы</a>
            <ul class="dropdown">
                <li><a href="${link.serbia}">КПТБ Сербии</a></li>
                <li><a href="${link.kirgiz}">КПТБ Киргизии</a></li>
                <li><a href="${link.ukraine}">МПТБ Украины</a></li>
                <li><a href="${link.germany}">КПТБ Германии</a></li>
                <li><a href="${link.tvorchestvo}">Союз Пролетарского Творчества</a></li>
                <li><a href="${link.italy}">КПТБ Италии</a></li>
                <li><a href="${link.newzealand}">КПТБ Новой Зеландии</a></li>
            </ul>
        </li>
        <li><a href="${link.videos}">Наши видео</a></li>
        <li><a href="${link.joint}">Присоединиться к нам</a></li>
    </ul>
    `);

menu.innerHTML = content2.join('');

const ground = document.querySelector('.ground');
let content3 = downLinks.map(linke => `
    <ul>
        <li class="nazwa">${linke.name}</li>
        <li><a href="${linke.youtube}">Наш Youtube</a></li>
        <li><a href="${linke.telegram}">Наш Telegram</a></li>
        <li><a href="${linke.instagram}">Наш Instagram</a></li>
        <li><a href="${linke.vk}">Наша группа Вконтакте</a></li>
    </ul>
    `);

ground.innerHTML = content3.join('');

function addLink() {
  var body_element = document.getElementsByTagName('body')[0];
  var selection;
  selection = window.getSelection();
  var pagelink = "<br /><br /> Источник: <a href='"+document.location.href+"'>"+document.location.href+"</a><br />";
  var copytext = selection + pagelink;
  var newdiv = document.createElement('div');
  newdiv.style.position='absolute';
  newdiv.style.left='-99999px';
  body_element.appendChild(newdiv);
  newdiv.innerHTML = copytext;
  selection.selectAllChildren(newdiv);
  window.setTimeout(function() {body_element.removeChild(newdiv)},0);
}
document.oncopy = addLink;
